x="abcd"
y=x
z="abcd"

print("查看对象标识是否相同")
print("“abcd”=",id("abcd"))
print("id(x)=",id(x))
print("id(y)=",id(y))
print("id(z)=",id(z))


#----------------------------------------------------------------
print("--------------------------------\n--------------------------------")
print("修改对象的值:\n x=[1,2,3] \n y=x \n z=[1,2,3] \n则：")
x=[1,2,3]
y=x
z=[1,2,3]

print("“abcd”=",id("abcd"))
print("[1,2,3]=",id([1,2,3]))
print("id(x)=",id(x))
print("id(y)=",id(y))
print("id(z)=",id(z))


#----------------------------------------------------------------
print("--------------------------------\n--------------------------------")
print("通过修改表的内容来修改表的对象，但不改变表的标识(id)：")

x[1]=10086
print("x[1]=",x[1],"\n")


print("“abcd”=",id("abcd"))
print("[1,10086,3]=",id([1,10086,3]))
print("id(x)=",id(x))
print("id(y)=",id(y))
print("id(z)=",id(z))



#----------------------------------------------------------------
print("--------------------------------\n--------------------------------")
print("如果拷贝对象，就得到另一个新对象。对共享对象的操作，会影响另一个关联。")

w=x.copy()
x.append(100)   #对共享对象的操作，会影响另一个关联。即：对 x 的操作会影响到 y
print("w=",w)
print("x=",x)
print("y=",y)

print("id(w)=",id(w))
print("id(x)=",id(x))
print("id(y)=",id(y))
print("id(z)=",id(z))


#----------------------------------------------------------------
print("--------------------------------\n--------------------------------")
print("对空表的操作:") 
a=b=[]
c,d = [],[]

print("id([])=",id([]))
print("id(a)=",id(a))
print("id(b)=",id(b))
print("id(c)=",id(c))
print("id(d)=",id(d))