#P199_空表也是个对象，当它被共享调用两资助时，结果会累加

def append5(a,b=[]):
    for i in range(5):
        b.append(a)
    return b


print("第一次调用空表：",append5(1,[]))
print("第二次调用空表，缺省参数：",append5(1))
print("第三次调用空表：",append5(1,[]))
print("第四次调用空表，缺省参数：",append5(1))        #第二次缺省输入参数，函数体再次使用默认参数，这个默认参数是函数体自己创建的空表，它被重复调用了


#------------------------------------------------
print("-----------------")
print("第五次调用空表，缺省参数：",append5(2))
print("第六次调用空表，缺省参数：",append5(2))
print("第七次调用空表：",append5(2,[]))
print("第八次调用空表：",append5(2,[]))