
#备注：集合的数据不重复，且顺序是内部的





##################################################################
#元组与集合之间的转换

#元组
tuple_1 =(1,2,3,1,2,3,"123","abc","fuck")
print("元组:",tuple_1)
print(type(tuple_1))
print("--------------------------------------")
#元组转成集合
tuple_to_set_1 = set(tuple_1)      
print("元组转成集合:",tuple_to_set_1)
print(type(tuple_to_set_1))
print("--------------------------------------")
#集合转成元组
set_to_tuple_1 = tuple(tuple_to_set_1)
print("集合转成元组:",set_to_tuple_1)
print(type(set_to_tuple_1))







###################################################################
print("--------------------------------------")
print("--------------------------------------")
#表与集合之间的转换

#表
list_1 = [1,2,3,1,2,3,"123","123","abc","abc"]
print("表：",list_1)
print(type(list_1))
print("--------------------------------------")
#表转成集合
list_to_set_1 = set(list_1)
print("表转成集合：",list_to_set_1)
print(type(list_to_set_1))
print("--------------------------------------")
#集合转成表
set_to_list_1 = list(list_to_set_1)
print("集合转成表：",set_to_list_1)
print(type(set_to_list_1))







###################################################################
print("--------------------------------------")
print("--------------------------------------")
#字符串与集合之间的转换

#字符串
str_1 = "1, 2, 3, 1, 2, 3, 123, 123, 123, abc, abc, abc,   "
print("字符串：",str_1)
print(type(str_1))
print("--------------------------------------")
#字符串转成集合
str_to_set_1 = set(str_1)
print("字符串转成集合：",str_to_set_1)
print(type(str_to_set_1))
print("--------------------------------------")
#集合转成字符串
set_to_str_1 = str(str_to_set_1)
print("集合转成字符串：",set_to_str_1)
print(type(set_to_str_1))








###################################################################
print("--------------------------------------")
print("--------------------------------------")
#字典与集合之间的转换

#字典
dict_1 = dict([('a',1),('b',2),('c',3),('e',4),('a',12222),('b',2),('c',3),('e',4)]) #字典关键字也是唯一的，所以同一关键字下的值是一样的！
print("字典：",dict_1)
print(type(dict_1))
print("--------------------------------------")
#字典转成集合
dict_to_set_1 = set(dict_1)
print("字典转成集合：",dict_to_set_1)        #字典转成集合，集合中只剩下字典的关键字
print(type(dict_to_set_1))
print("--------------------------------------")
#集合转成字典
    #这个方法失败，因为字典是一对一的键值对，一般集合无此规律
    # set_to_dict_1 = dict(dict_to_set_1)
    # print("集合转成字典：",set_to_dict_1)
    # print(type(set_to_dict_1))
set1 = {'apple','banana','cherry'}
set2 = {1,2,3}
dict_to_set_1 = dict(zip(set1,set2))
print("集合转成字典：",dict_to_set_1)
print(type(dict_to_set_1))