#copy()方法，表的拷贝，实际上只做了最上面一层，重到了一个新表，但表中的元素仍然是与原表共享的。

a1 = [[i+j for i in range(3)] for j in range(3)]
a2 = a1.copy()      #拷贝就是创建不同对象，但其内元素又同一对象
a3 = a1

print("a1:",a1, "\n id:",id(a1))
a1[2][2]=10086
id(a1[2][2])
print("a1[2][2])id:",id(a1[2][2]))
print("a2:",a2, "\n id:",id(a2))        
print("a3:",a3, "\n id:",id(a3))

print("------------------------------------------------")
a1[1] = [666,666,666]   #给a1的第二行赋值是换个行向量，不影响a2。 但与a1同一对象的a3受影响
print("a1:",a1, "\n id:",id(a1))
print("a2:",a2, "\n id:",id(a2))
print("a3:",a3, "\n id:",id(a3))