# 原书没写出来的代码在：P335页_class_平面收入几何图形.py


# -------------------------------------------------------------------------
# P368页新增代码
class Shape:
    def name(self): return "Shape"
    def show(self):
        print("I am a", self.name() + ".",       # self.name() 与 self.area() 都是调用子类自己的方法，这就是动态约束。
              "My area is", self.area())         # 在父类中调用时，如果子类有同名方法，子类方法优先。
                                          
# -------------------------------------------------------------------------


    
# 省略代码......

# -------------------------------------------------------------------------
# # 子类：点类   继承自(Shape)
# class Point:          # 原代码
class Point(Shape):     # P368页：改的代码
# -------------------------------------------------------------------------
    def __init__(self, x, y):
        self._x = x
        self._y = y

    def area(self):  # 点没有面积
        return 0
    
    # 省略代码......
        
# -------------------------------------------------------------------------
    def name(self): return "Point"          # P368页新增代码
# -------------------------------------------------------------------------


# 没用的代码都省略...... 


########################################################################
print("----------------------------------------------------------------")
print("P368页代码:")
x = Point(2,3)
x.show()        # show()是调用父类(Shape)方法。
print(x.name())
